Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveElementWithoutWorkplane Property
 Element(s) need a workplane to be moved in. There's no workplane defined in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveElementWithoutWorkplane { get; }
Public Shared ReadOnly Property CannotMoveElementWithoutWorkplane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveElementWithoutWorkplane {
	FailureDefinitionId^ get ();
}
static member CannotMoveElementWithoutWorkplane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace